
def SumUp(n1:int,n2:int) -> int:
    return n1 + n2

print(SumUp(5,2)) # 7
print(SumUp(1,3)) # 4
print(SumUp(12,9)) # 21
print(SumUp(51,7513)) # 7564
print(SumUp(1351,4622)) # 5973


# : int უთხარი ტიპის ჩეკერს რომ ამ ფინქციაში უეჭველი int ტიპი უნდა იყოს
# ფუნქცია არ გაიშვება თუ არ იყო გამოძახებული
# ფუნქცია იღებს არგუმენტებს და აბრუნებს შედეგს
# თუ ფუნქციას არ აქვს არგუმენტები მაშინ () უნდა იყოს
# თუ ფუნქციას არ აქვს return ის დააბრუნებს None
# ფუნქციას შეიძლება ჰქონდეს self სტრინგი ტუ ის არის კლასის ფუნქცია
# ფუნქცია შეიძლება იყოს გამოყენებადი უსასრულოდ
# კლასის ფუნქცია შეიძლება სხვა კლასმა ნიშანთვისება აიღოსოს
# ფუნქციას აქვს დროის კომპლექსია ეს ფუნქცია O(1) დროის კომპლექსია აქვს მაგრამ არის O(n) დროის კომპლექსია O(n^2) O(log n) O(n log n) O(2^n) O(n!) O(1) O(n^3)
# ფუნქციაში შეგიძლია შექმნა სხვა ფუნქცია მაგრამ იმ ფუნქციას ფუნქციის გარეთ ვერ გამოიყენებ 
# ფუნქციაში შეგიძლია შექმნა ცვლადი მაგრამ იმ ცვლადს ფუნქციის გარეთ ვერ გამოიყენებ
# ფუნქციაში შეგიძლია შექმნა ლამბდა ფუნქცია
# მაგრამ იმ ლამბდა ფუნქციას ფუნქციის გარეთ ვერ გამოიყენებ