#2) მომხამრებელს შემოატანინეთ ახლანდელი ასაკი ასევე შემოატანინეთ ახლანდელი წელი, 
# შემდეგ შეეკითხეთ რამდენი წლით სურს დროში მოგზაურობა 
# შემდეგ კი დაბეჭდეთ ერთ გრძელ წინადადებაში რამდენი წლის იქნება მომხარებელი 
# დროში მოგზაურობის შემდეგ და რომელი წელიწადი იქნება დროში მოგზაურობის შემდეგ


year = input("ახლანდელი წელი: ")
age = input("თქვენი ასაკი: ")
timetravel = input("რამდენ წლით გინდათ დროში მოგზაურობა")

print(timetravel, "წელში შენ იქნები", int(age) + int(timetravel), "წლის და იქნები წელში:" , int(year) + int(timetravel))