# 3) შეადარეთ თქვენი ასაკი მომხმარებლის შემოტანილ ასაკს, თუ თქვენი ასაკი მეტია მომხმარებლის ასაკზე უთხარით რომ თქვენ მასზე დიდი ხართ, 
# თუ მასზე პატარა ხართ დაუპრინტეთ რომ მასზე პატარა 
# ხართ და სხვა შემთხვევაში დაუპრინტეთ რომ ტოლები ხართ.

# მომხმარებლის ასაკის შეყვანა
age = int(input("გთხოვთ, შეიტანოთ თქვენი ასაკი: "))

# ჩემი ასაკი
my_age = 16  # აქ შეგიძლიათ ჩაწეროთ თქვენი ასაკი

# ასაკის შედარება
if my_age > age:
    print(f"მე შენზე {my_age - age} წლით დიდი ვარ!")
elif my_age < age:
    print(f"მე შენზე {age - my_age} წლით პატარა ვარ!")
else:
    print("ჩვენ ასაკი ტოლი გვაქვს!")
